const markers = [
{
    name: "しょうゆバター味",
    category: "popcorn",
    lat: 35.6338108019477,
    lng: 139.88056946100153
  },

  {
    name: "キャラメル味",
    category: "popcorn",
    lat: 35.631484512194405,
    lng: 139.8786118876311
  },

  {
    name: "塩味",
    category: "popcorn",
    lat: 35.63226241087617,
    lng: 139.87868158205404
  },

  {
    name: "ハニー味",
    category: "popcorn",
    lat: 35.631248196980984,
    lng: 139.87974443746873
  },

  {
    name: "ポップコーン専門店",
    category: "popcorn",
    lat: 35.63151166818746,
    lng: 139.87945807691634
  },

  {
    name: "コンポタ味",
    category: "popcorn",
    lat: 35.63099732244331,
    lng: 139.88087439259698
  },

  {
    name: "ブラックペッパー味",
    category: "popcorn",
    lat: 35.631954898812246,
    lng: 139.88256668987793
  },

  {
    name: "キャラメル味②",
    category: "popcorn",
    lat: 35.633563095725094,
    lng: 139.8794883027647
  },

  {
    name: "ミルクチョコレート味",
    category: "popcorn",
    lat: 35.63005416417772,
    lng: 139.87971737631196
  },

  {
    name: "ハニー味②",
    category: "popcorn",
    lat: 35.630286049168404,
    lng: 139.87986146318096
  },

  {
    name: "カレー味",
    category: "popcorn",
    lat: 35.63287651752296,
    lng: 139.8819705823898
  },

  // ===== フード =====

  {
    name: "テリヤキチキンレッグ",
    category: "food",
    lat: 35.63355563854234,
    lng: 139.88219916220535
  },

  {
    name: "スモークターキーレッグ",
    category: "food",
    lat: 35.632115797333114,
    lng: 139.8842140953605
  },

  // ===== トイレ =====

    {
  name: "トイレ（トゥモローランド・スタージェット前）",
  category: "toilet",
  lat: 35.63368011332947,
  lng: 139.87889997670104
},
{
  name: "トイレ（ベイマックスのハッピーライド前）",
  category: "toilet",
  lat: 35.63239391006974,
  lng: 139.87888364644343
},
{
  name: "トイレ（美女と野獣エリア入口前）",
  category: "toilet",
  lat: 35.6314613997614,
  lng: 139.87882029079813
},
{
  name: "トイレ（パーク南端・ジャングルクルーズ方面）",
  category: "toilet",
  lat: 35.629765685768795,
  lng: 139.88007305303117
},
{
  name: "トイレ（イッツ・ア・スモールワールド前）",
  category: "toilet",
  lat: 35.630928800754056,
  lng: 139.88030256353176
},
{
  name: "トイレ（スプラッシュ・マウンテン下）",
  category: "toilet",
  lat: 35.63035420859266,
  lng: 139.88349412694708
},
{
  name: "トイレ（カヌー探険乗り場手前）",
  category: "toilet",
  lat: 35.631583089277406,
  lng: 139.8836004347372
},
{
  name: "トイレ（カヌー探険乗り場奥）",
  category: "toilet",
  lat: 35.63171852323976,
  lng: 139.8847613486772
},
{
  name: "トイレ（ビッグサンダー・マウンテン下）",
  category: "toilet",
  lat: 35.63257049174343,
  lng: 139.88335266495415
},
{
  name: "トイレ（センタープラザ・スプラッシュ方面）",
  category: "toilet",
  lat: 35.63274816303381,
  lng: 139.88130232241477
},
{
  name: "トイレ（ジャングルクルーズ前）",
  category: "toilet",
  lat: 35.63390165430816,
  lng: 139.88214109093343
},
{
  name: "トイレ（カリブの海賊前）",
  category: "toilet",
  lat: 35.63387167954913,
  lng: 139.88162543624406
},
{
  name: "トイレ（ビッグサンダー・マウンテン奥）",
  category: "toilet",
  lat: 35.63209627175254,
  lng: 139.88397503989827
},
{
  name: "トイレ（トゥモローランド・ファンタジーランド境界）",
  category: "toilet",
  lat: 35.63210443659148,
  lng: 139.8821856373807
},
{
  name: "トイレ（アリスのティーパーティー付近）",
  category: "toilet",
  lat: 35.631054676741726,
  lng: 139.8813122778588
},
{
  name: "トイレ（カリブ〜ウエスタン中間）",
  category: "toilet",
  lat: 35.63434647023537,
  lng: 139.8814895958364
},
{
  name: "トイレ（カリブの海賊手前・救護室横）",
  category: "toilet",
  lat: 35.63464873431085,
  lng: 139.88041880479372
},
{
  name: "トイレ（ワールドバザール右奥）",
  category: "toilet",
  lat: 35.63445255388876,
  lng: 139.8788793297422
},
{
  name: "トイレ（ワールドバザール左奥）",
  category: "toilet",
  lat: 35.63487154954155,
  lng: 139.87997139277076
}

];
